## **Разработка фрагмента технического задания**
   1. **Требования к системе в целом**
      1. ## **Требования к структуре и функционированию системы**
Система продажа автомобилей должна иметь такие подсистемы как:

- Подсистема для обработки поступившего запроса, которая может обрабатывать данные о клиенте, проводить проверку запроса на корректность, и в которой можно создать заявку.
- Различные подсистемы для тестирования и выявления ошибок. С помощью которых можно будет тестировать систему приложения и систему кодирования.
- Подсистема для ведения договоров, в которой будут храниться


данные о клиентах, о заключенных договорах.

- Подсистема для закупки оборудования или других принадлежностей, для реализаций заказов клиентов.
- Подсистема закупок автомобилей с БУ рынка.
  1. ## **Требования к надежности**
Требования к обеспечению надежного функционирования программы:

- предусмотреть контроль вводимой информации;
- предусмотреть блокировку некорректных действий пользователя при работе с системой;
- обеспечить целостность хранимой информации;
- предусмотреть возможность отказа и поломки системы.
- критические ошибки в подсистемах организации, не выявленные при отладке и испытаниях.

Требования	к	надежности	технических	средств	и	программного обеспечения:

- С целью повышения отказоустойчивости, система должна иметь возможность переключиться на резервные сервера, в случае отказа основных;
- С целью обеспечения надежности хранения данных, система должна иметь возможность дублировать самые важные данные в резервных хранилищах данных;
- С целью обеспечения бесперебойной работы автосалона, система должна иметь средства, для автоматического устранения проблем с АС.
  1. ## **Дополнительные требования**
Конструктивные требования для сервисных работ:

- Сервисные специалисты должны иметь нужный размер и форму для удобного перемещения по автомастерской;
- Сервисные специалисты должны быть обеспечены необходимым оборудованием для выполнения ТО;
- Сервисные специалисты должны проходить тестовые задания, чтобы

31
![](Aspose.Words.5c074bf1-e67b-4423-a331-f476ff3ad114.019.png)

не терять знания.
1. ## **Требования к функциям (задачам), выполняемым системой**
   1. **Перечень функций или задач каждой подсистемы, подлежащих автоматизации**
1. Подсистема для обработки поступившего запроса должна:
- Иметь возможность обрабатывать данные о клиенте, оставившем запрос;
- Проводить проверку запроса на корректность;
- Иметь форму для создания заявки.
1. Подсистема анализа заявки должна:
- Уметь анализировать поступившие данные о клиенте;
- Классифицировать предпочтения;
- Обрабатывать и хранить данные об автомобиле.
1. Подсистема классификации и кодирования должна:
- Классифицировать предпочтения для дальнейшей кодировки;
- Кодировать предпочтения для подготовки.
1. Подсистема управления сервисом должна:
- Иметь возможность закупать товар по его окончанию;
- Иметь возможность управлять сотрудниками, отдавая им команды;
- Иметь возможность получать и анализировать ошибки системы.
1. Подсистема для контроля ошибок должна:
- Выявлять ошибки остальных подсистем;
- Обрабатывать ошибки;
- Создавать отчеты об ошибках;
- Тестировать подсистемы для выявления ошибок.
1. Подсистема для создания объявлений должна:
- Генерировать форму объявления;
- Получать введенные данные;
- Создавать объявление;

- Выгружать объявления на страницу сайта.
1. Подсистема для ведения договоров должна:
- Генерировать договор;
- Принимать данные заполнения договора;
- Проверять подписи;
- Обрабатывать данные;
- Отправлять данные на хранение.
  1. ## **Требования к видам обеспечения.**
     1. **Требования к информационному обеспечению**
1. Данные о клиенте, запросе, результате проверки на корректность, данные анализа, классификации предметов, данные сортировки и кодирования, данные о личности клиента, подписании договора, условиях выдачи и все остальные, должны храниться в СУБД MySQL.
1. Обмен данными между клиентской и серверной частью должен осуществляться в формате JSON.
1. Заявка должна иметь статусы, и возможность последовательного их изменения. Статус заявки предполагает такие вариации как: «Активная заявка», «Заявка в обработке», «Закрытая заявка».
   1. ## **Требования к программному обеспечению**
1. Серверное ПО должно иметь возможность установки на операционные системы под управление Windows и Linux.
1. Клиентское мобильное приложение должно иметь возможность установки на устройства с операционной системой Android версией не ниже

   4. KitKat и IOS не ниже версии 7.1.2.
1. Клиентское веб-приложение требует для запуска браузеры на движке Chromium, такие как «Opera», «Chrome», «Microsoft Edge», «Яндекс.Браузер»
## **8.3.3 Требования к техническому оборудованию**
1. Для взаимодействия клиента с системой необходим смартфон или

ПК.

Минимальные требования для смартфона:

0. 2ГБ оперативной памяти;
0. 32ГБ внутренний памяти;
0. Процессор Qualcomm Snapdragon от 600 серии или аналогичный ему Apple A6.

Минимальные требования для пользовательского ПК:

0. Компьютер с под управлением операционной системой Windows 7 home basic x64 или Ubuntu 12.04 LTS;
0. 2ГБ оперативной памяти;
0. Видеокарта с 256МБ видеопамяти;
0. Процессор Intel Pentium 4 или Athlon 750;
0. Жесткий диск на 64ГБ памяти.
1. Для хранения данных БД необходим сервер. Минимальные требования к серверу:

   0. SSD на 300ГБ и больше;
   0. Оперативная память 32ГБ и больше;
   0. Процессор 4 ядра (8 логических потоков), частота 3-3,5 ГГц и больше;
   0. Пропускная способность сетевого интерфейса 1Гбит/с.
1. Для взаимодействия сотрудника с системой необходим ПК. Минимальные требования к ПК:

   0. Компьютер под управлением операционной системой Windows 10 1909 или Ubuntu 20.04 LTS;
   0. SSD для хранения данных на 120ГБ;
   0. Оперативная память 8ГБ;
   0. Процессор Intel от 7 поколения или AMD Ryzen (от Zen+).
